load-testing/load-testing.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="load-testing" enabled="true">
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="LOGS_TOKEN_FILE" elementType="Argument">
            <stringProp name="Argument.name">LOGS_TOKEN_FILE</stringProp>
            <stringProp name="Argument.value">${__P(workspace,)}\\${__P(logs.token,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="LOGS_LOGIN_FILE" elementType="Argument">
            <stringProp name="Argument.name">LOGS_LOGIN_FILE</stringProp>
            <stringProp name="Argument.value">${__P(workspace,)}\\${__P(logs.login,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="LOGS_PRODUCTS_FILE" elementType="Argument">
            <stringProp name="Argument.name">LOGS_PRODUCTS_FILE</stringProp>
            <stringProp name="Argument.value">${__P(workspace,)}\\${__P(logs.products,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="INPUT_DATA_CSV" elementType="Argument">
            <stringProp name="Argument.name">INPUT_DATA_CSV</stringProp>
            <stringProp name="Argument.value">${__P(workspace,)}\\${__P(input.data,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="RESULTS_PATH" elementType="Argument">
            <stringProp name="Argument.name">RESULTS_PATH</stringProp>
            <stringProp name="Argument.value">${__P(workspace,)}\\results\\${__time(YMDHMS,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="LOGGING_GROOVY" elementType="Argument">
            <stringProp name="Argument.name">LOGGING_GROOVY</stringProp>
            <stringProp name="Argument.value">${__P(workspace,)}\\${__P(scripts.logging,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TRACING_GROOVY" elementType="Argument">
            <stringProp name="Argument.name">TRACING_GROOVY</stringProp>
            <stringProp name="Argument.value">${__P(workspace,)}\\${__P(scripts.tracing,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <kg.apc.jmeter.threads.SteppingThreadGroup guiclass="kg.apc.jmeter.threads.SteppingThreadGroupGui" testclass="kg.apc.jmeter.threads.SteppingThreadGroup" testname="stepping-thread-group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <stringProp name="ThreadGroup.num_threads">${__P(TOTAL_THREAD,5)}</stringProp>
        <stringProp name="Threads initial delay">0</stringProp>
        <stringProp name="Start users count">${__P(ADD_THREAD,1)}</stringProp>
        <stringProp name="Start users count burst">${__P(START_THREAD,1)}</stringProp>
        <stringProp name="Start users period">${__P(ADD_EVERY,25)}</stringProp>
        <stringProp name="Stop users count">${__P(STOP_THREADS,1)}</stringProp>
        <stringProp name="Stop users period">${__P(STOP_EVERY,10)}</stringProp>
        <stringProp name="flighttime">${__P(HOLD_THREADS,25)}</stringProp>
        <stringProp name="rampUp">10</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
      </kg.apc.jmeter.threads.SteppingThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="csv - login" enabled="true">
          <stringProp name="filename">${INPUT_DATA_CSV}</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">EMAIL,PASSWORD</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="IF previous request is ok THEN call token" enabled="true">
          <stringProp name="IfController.condition">${JMeterThread.last_sample_ok}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="rest-client - token" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="grant_type" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  <stringProp name="Argument.name">grant_type</stringProp>
                  <stringProp name="Argument.value">${__P(rest-clients.token.body.grant-type,)}</stringProp>
                </elementProp>
                <elementProp name="username" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  <stringProp name="Argument.name">username</stringProp>
                  <stringProp name="Argument.value">${__P(rest-clients.token.body.username,)}</stringProp>
                </elementProp>
                <elementProp name="password" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  <stringProp name="Argument.name">password</stringProp>
                  <stringProp name="Argument.value">${__P(rest-clients.token.body.password,)}</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${__P(rest-clients.token.server,)}</stringProp>
            <stringProp name="HTTPSampler.port">${__P(rest-clients.token.port,)}</stringProp>
            <stringProp name="HTTPSampler.protocol">${__P(rest-clients.token.protocol,)}</stringProp>
            <stringProp name="HTTPSampler.path">${__P(rest-clients.token.endpoint,)}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="pre-request - traceParent" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">String scriptPath = vars.get(&quot;TRACING_GROOVY&quot;)

def tracingInstance = vars.getObject(&quot;tracingInstance&quot;)
if(tracingInstance == null) {
	tracingInstance = new GroovyShell(binding).parse(new File(scriptPath))
	vars.putObject(&quot;tracingInstance&quot;, tracingInstance)
}

String traceParent = tracingInstance.generateTraceParent()
vars.put(&quot;TRACE_PARENT&quot;, traceParent)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PreProcessor>
            <hashTree/>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="headers - token" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">${__P(rest-clients.token.header.content-type,)}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">traceParent</stringProp>
                  <stringProp name="Header.value">${TRACE_PARENT}</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="json extractor - access_token" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">ACCESS_TOKEN</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.access_token</stringProp>
              <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            </JSONPostProcessor>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="post-response - token logs" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">String scriptPath = vars.get(&quot;LOGGING_GROOVY&quot;)

def loggingInstance = new GroovyShell(binding).parse(new File(scriptPath))
vars.putObject(&quot;loggingTokenInstance&quot;, loggingInstance)
def binding = new Binding()
binding.setVariable(&quot;log&quot;, log)
binding.setVariable(&quot;prev&quot;, prev)
binding.setVariable(&quot;vars&quot;, vars)
binding.setVariable(&quot;props&quot;, props)

String loggingFile = vars.get(&quot;LOGS_TOKEN_FILE&quot;)
String serviceName = props.getProperty(&quot;rest-clients.token.service-name&quot;, &quot;Undefined&quot;)
loggingInstance.printLogs(loggingFile, serviceName)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="IF token is ok THEN call login" enabled="true">
          <stringProp name="IfController.condition">${JMeterThread.last_sample_ok}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="rest-client - login" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
    	&quot;email&quot;: &quot;${EMAIL}&quot;,&#xd;
 	&quot;password&quot;: &quot;${PASSWORD}&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${__P(rest-clients.login.server,)}</stringProp>
            <stringProp name="HTTPSampler.port">${__P(rest-clients.login.port,)}</stringProp>
            <stringProp name="HTTPSampler.protocol">${__P(rest-clients.login.protocol,)}</stringProp>
            <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
            <stringProp name="HTTPSampler.path">${__P(rest-clients.login.endpoint,)}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="pre-request - traceParent" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">String scriptPath = vars.get(&quot;TRACING_GROOVY&quot;)

def tracingInstance = vars.getObject(&quot;tracingInstance&quot;)
if(tracingInstance == null) {
	tracingInstance = new GroovyShell(binding).parse(new File(scriptPath))
	vars.putObject(&quot;tracingInstance&quot;, tracingInstance)
}

String traceParent = tracingInstance.generateTraceParent()
vars.put(&quot;TRACE_PARENT&quot;, traceParent)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PreProcessor>
            <hashTree/>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="headers - login" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">${__P(rest-clients.login.header.content-type,)}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Subscription-Key</stringProp>
                  <stringProp name="Header.value">${__P(rest-clients.login.header.subscription-key,)}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${ACCESS_TOKEN}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">traceParent</stringProp>
                  <stringProp name="Header.value">${TRACE_PARENT}</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="post-response - login logs" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">String scriptPath = vars.get(&quot;LOGGING_GROOVY&quot;)

def loggingInstance = new GroovyShell(binding).parse(new File(scriptPath))
vars.putObject(&quot;loggingTokenInstance&quot;, loggingInstance)
def binding = new Binding()
binding.setVariable(&quot;log&quot;, log)
binding.setVariable(&quot;prev&quot;, prev)
binding.setVariable(&quot;vars&quot;, vars)
binding.setVariable(&quot;props&quot;, props)

String loggingFile = vars.get(&quot;LOGS_LOGIN_FILE&quot;)
String serviceName = props.getProperty(&quot;rest-clients.login.service-name&quot;, &quot;Undefined&quot;)
loggingInstance.printLogs(loggingFile, serviceName)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="IF login is ok THEN call products" enabled="true">
          <stringProp name="IfController.condition">${JMeterThread.last_sample_ok}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="rest-client - products" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${__P(rest-clients.products.server,)}</stringProp>
            <stringProp name="HTTPSampler.port">${__P(rest-clients.products.port,)}</stringProp>
            <stringProp name="HTTPSampler.protocol">${__P(rest-clients.products.protocol,)}</stringProp>
            <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
            <stringProp name="HTTPSampler.path">${__P(rest-clients.products.endpoint,)}</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="pre-request - traceParent" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">String scriptPath = vars.get(&quot;TRACING_GROOVY&quot;)

def tracingInstance = vars.getObject(&quot;tracingInstance&quot;)
if(tracingInstance == null) {
	tracingInstance = new GroovyShell(binding).parse(new File(scriptPath))
	vars.putObject(&quot;tracingInstance&quot;, tracingInstance)
}

String traceParent = tracingInstance.generateTraceParent()
vars.put(&quot;TRACE_PARENT&quot;, traceParent)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PreProcessor>
            <hashTree/>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="headers - products" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">${__P(rest-clients.login.header.content-type,)}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Subscription-Key</stringProp>
                  <stringProp name="Header.value">${__P(rest-clients.login.header.subscription-key,)}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${ACCESS_TOKEN}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">traceParent</stringProp>
                  <stringProp name="Header.value">${TRACE_PARENT}</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="post-response - login logs" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">String scriptPath = vars.get(&quot;LOGGING_GROOVY&quot;)

def loggingInstance = new GroovyShell(binding).parse(new File(scriptPath))
vars.putObject(&quot;loggingProductsInstance&quot;, loggingInstance)
def binding = new Binding()
binding.setVariable(&quot;log&quot;, log)
binding.setVariable(&quot;prev&quot;, prev)
binding.setVariable(&quot;vars&quot;, vars)
binding.setVariable(&quot;props&quot;, props)

String loggingFile = vars.get(&quot;LOGS_PRODUCTS_FILE&quot;)
String serviceName = props.getProperty(&quot;rest-clients.products.service-name&quot;, &quot;Undefined&quot;)
loggingInstance.printLogs(loggingFile, serviceName)</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="summary-report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${RESULTS_PATH}\\summary-report.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="view-results-tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${RESULTS_PATH}\\view-result-tree.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="view-results-in-table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${RESULTS_PATH}\\result-table.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>